tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "peak/tap"
tap "teamookla/speedtest"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# Implementation of the DNS protocols
brew "bind"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Sophisticated file transfer program
brew "lftp"
# Portable Foreign Function Interface library
brew "libffi"
# LLVM's OpenMP runtime library
brew "libomp"
# Library for solving packages and reading repositories
brew "libsolv"
# Small memory footprint, flexible web-server
brew "lighttpd"
# Access large language models from the command-line
brew "llm"
# Next-gen compiler infrastructure
brew "llvm"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Feature-rich command-line audio/video downloader
brew "yt-dlp", link: false
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# QR Code generation
brew "qrencode"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform library for audio I/O
brew "portaudio"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Transfer files to and from your computer by scanning a QR code
brew "qrcp"
# Diff filter highlighting which line parts have changed
brew "riff"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SOund eXchange: universal sound sample translator
brew "sox"
# Non-interactive SSH password auth
brew "sshpass"
# System performance benchmark tool
brew "sysbench"
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# Swift native on-device speech recognition with Whisper for Apple Silicon
brew "whisperkit-cli"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Parallel S3 and local filesystem execution tool
brew "peak/tap/s5cmd"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Command-line interface for 1Password
cask "1password-cli"
# Android SDK component
cask "android-platform-tools"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Customise mouse behavior
cask "linearmouse"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Music player for The Hype Machine
cask "plug"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "arthurwhite.white"
vscode "catppuccin.catppuccin-vsc"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "glenn2223.live-sass"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "maciejdems.add-to-gitignore"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "pnp.polacode"
vscode "proxzima.sweetdracula"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sswg.swift-lang"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "tyriar.vscode-terminal-here"
vscode "vadimcn.vscode-lldb"
vscode "vknabel.vscode-apple-swift-format"
vscode "whetstonetechnologiesinc.speechmarkdown-vscode"
vscode "yzhang.markdown-all-in-one"
