tap "homebrew/bundle"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "teamookla/speedtest"
# Arbitrary precision numeric processing language
brew "bc"
# Implementation of the DNS protocols
brew "bind"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Core application library for C
brew "glib"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Access large language models from the command-line
brew "llm"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform library for audio I/O
brew "portaudio"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Software for mathematics, science, and engineering
brew "scipy"
# System performance benchmark tool
brew "sysbench"
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# Swift native on-device speech recognition with Whisper for Apple Silicon
brew "whisperkit-cli"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Android SDK component
cask "android-platform-tools"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Customise mouse behavior
cask "linearmouse"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Music player for The Hype Machine
cask "plug"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "arthurwhite.white"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "glenn2223.live-sass"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "maciejdems.add-to-gitignore"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "proxzima.sweetdracula"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sswg.swift-lang"
vscode "supermaven.supermaven"
vscode "tyriar.vscode-terminal-here"
vscode "vadimcn.vscode-lldb"
vscode "vknabel.vscode-apple-swift-format"
vscode "whetstonetechnologiesinc.speechmarkdown-vscode"
vscode "yzhang.markdown-all-in-one"
