tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "peak/tap"
tap "teamookla/speedtest"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# Implementation of the DNS protocols
brew "bind"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Core application library for C
brew "glib"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Feature-rich command-line audio/video downloader
brew "yt-dlp", link: false
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# QR Code generation
brew "qrencode"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform library for audio I/O
brew "portaudio"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Transfer files to and from your computer by scanning a QR code
brew "qrcp"
# Software for mathematics, science, and engineering
brew "scipy"
# SOund eXchange: universal sound sample translator
brew "sox"
# System performance benchmark tool
brew "sysbench"
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Parallel S3 and local filesystem execution tool
brew "peak/tap/s5cmd"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Command-line interface for 1Password
cask "1password-cli"
# Android SDK component
cask "android-platform-tools"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Customise mouse behavior
cask "linearmouse"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Music player for The Hype Machine
cask "plug"
